"""
Дан словарь {‘v’: ‘s001’, ‘v1’: ‘s002’, ‘v2’: ‘s001’, ‘v3’: ‘s005’, ‘v4’: ‘s005’, ‘v5’: ‘s009’, ‘v6’: ‘s007’}.
Выведите на экран все значения словаря таким образом, чтобы ни одно из них не повторялось.
"""
s = {"v": "s001", "v1": "s002", "v2": "s001", "v3": "s005", "v4": "s005", "v5": "s009", "v6": "s007"}
new = set(s.values())
print(new)
print("s001" in s)
