"""
Дана строка, состоящая из одного слова. Преобразуйте строку таким образом,
чтобы все буквы были разделены между собой пробелами.
"""
text = "карапуз"
s = text.replace('', ' ')
print(s)
