"""Дана байтовая строка. Перевести ее в шестнадцатеричный формат. Проверить результат по таблице ASCII."""
s = b'american'
print(s.hex())
