"""3. Написать рекурсивную функцию поиска максимального элемента числовой последовательности."""
l = [1, 2, 3, 4, 5, 6, 7, 34, 67, 23, 5, 6, 7, 8]


def foo(x):
    if len(x) > 1:
        return max(x[0], foo(x[1::]))
    else:
        return x[0]


print(foo(l))
